//#include <iostream>
///*
//	for()函数
//	1.50到100的整数累加
//	2.打印10到0之间的整数，递减（--）
//	3.输入两个整数，打印出其之间的整数
//*/
//
//int main() 
//{
//	/*
//	1.50到100的整数累加
//	int sum = 0;
//	for (int i = 50; i <= 100; ++i)
//	{
//		sum += i;
//	}
//	std::cout << "50到100的整数累加和为:"
//		<< sum << std::endl;*/
//
//	/*
//	2.打印10到0之间的整数，递减（--）
//	std::cout << "10到0之间的整数有:";
//	for (int i = 10; i >= 0; i--)
//	{
//		std::cout << i << " ";
//	}*/
//	int v1, v2 = 0;
//	std::cout << "输入两个整数，打印出其之间的整数:" << std::endl;
//	std::cin >> v1 >> v2;
//	for ()
//	{
//
//	}
//	return 0;
//}